import pandas as pd
import pytest


@pytest.fixture
def test_excel_data():
    return pd.DataFrame(
        {
            "Дата операции": ["20.07.2019 15:28:23", "20.07.2019 15:27:44"],
            "Дата платежа": ["22.07.2019", "22.07.2019"],
            "Номер карты": ["*4556", "*4556"],
            "Статус": ["OK", "OK"],
            "Сумма операции": [-5000.0, -5000.0],
            "Валюта операции": ["RUB", "RUB"],
            "Сумма платежа": [-5000.0, -5000.0],
            "Валюта платежа": ["RUB", "RUB"],
            "Кэшбэк": ["", "2"],
            "Категория": ["Наличные", "Супермаркеты"],
            "MCC": [6011.0, 6011.0],
            "Описание": ["Снятие в банкомате Сбербанк", "Снятие в банкомате Сбербанк"],
            "Бонусы (включая кэшбэк)": [0, 2],
            "Округление на инвесткопилку": [0, 0],
            "Сумма операции с округлением": [5000.0, 5000.0],
        }
    )


@pytest.fixture
def test_excel_file():
    return [
        {
            "Дата операции": "20.07.2019 15:28:23",
            "Дата платежа": "22.07.2019",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -5000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -5000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Наличные",
            "MCC": 6011.0,
            "Описание": "Снятие в банкомате Сбербанк",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 5000.0,
        },
        {
            "Дата операции": "20.07.2019 15:27:44",
            "Дата платежа": "22.07.2019",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -5000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -5000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "2",
            "Категория": "Супермаркеты",
            "MCC": 6011.0,
            "Описание": "Снятие в банкомате Сбербанк",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 5000.0,
        },
    ]


@pytest.fixture
def test_excel_file_2():
    return [
        {
            "Дата операции": "20.07.2019 15:28:23",
            "Дата платежа": "22.07.2019",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -5000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -5000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Наличные",
            "MCC": 6011.0,
            "Описание": "Снятие в банкомате Сбербанк",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 5000.0,
        },
        {
            "Дата операции": "20.07.2019 15:27:44",
            "Дата платежа": "22.07.2019",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -5000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -5000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "2",
            "Категория": "Супермаркеты",
            "MCC": 6011.0,
            "Описание": "Снятие в банкомате Сбербанк",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 5000.0,
        },
        {
            "Дата операции": "21.07.2019 15:28:23",
            "Дата платежа": "22.07.2019",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -1000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -1000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Наличные",
            "MCC": 6011.0,
            "Описание": "Снятие в банкомате Сбербанк",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 1000.0,
        },
        {
            "Дата операции": "21.07.2019 15:27:44",
            "Дата платежа": "22.07.2019",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -1000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -1000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "2",
            "Категория": "Супермаркеты",
            "MCC": 6011.0,
            "Описание": "Лента",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 1000.0,
        },
        {
            "Дата операции": "22.07.2019 15:28:23",
            "Дата платежа": "22.07.2019",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -2000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -2000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Наличные",
            "MCC": 6011.0,
            "Описание": "Снятие в банкомате Сбербанк",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 2000.0,
        },
        {
            "Дата операции": "22.07.2019 15:27:44",
            "Дата платежа": "22.07.2019",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -3000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -3000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "2",
            "Категория": "Супермаркеты",
            "MCC": 6011.0,
            "Описание": "Лента",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 3000.0,
        },
    ]


@pytest.fixture
def sample_dataframe():
    """Фикстура с тестовым DataFrame."""
    return pd.DataFrame({"Категория": ["Продукты", "Развлечения"], "Сумма трат": [4500, 500]})
